OdRxObject.copyFrom(OdRxObject!System.Runtime.CompilerServices.IsConst*)
details
Copies the contents of the specified object into this object.
\param pSource [in] Pointer to the source object.
\remarks
The default implementation of this function does nothing but throw an eNotApplicable exception.
Throws:
eNotApplicable Exception

OdRxObject.clone
\details
Creates a *clone* of this object, and returns a pointer to the *clone*.

OdRxObject.cast(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Casts the specified raw pointer to the smart pointer.
\param pointer [in]  Raw pointer to be cast.

OdRxObject.Dispose
\details
The virtual destructor for this class.

OdRxObject.#ctor
\details
Default constructor for this class.

OdRxObject.new(System.UInt64)
\details
Protects derived OdRxObject objects from direct use of new and delete operators.

OdRxObject.op_Assign(OdRxObject!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator prohibited.

OdRxObject.#ctor(OdRxObject!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for this class that assigns another Rx-object.